nonguilogs.log
Creating summariser <summary>
Created the tree successfully using data_creation_nongui.jmx
Starting the test @ Mon Jul 13 14:21:08 IST 2020 (1594630268812)
Waiting for possible Shutdown/StopTestNow/Heapdump message on port 4445
summary +      1 in 00:00:01 =    0.8/s Avg:  1033 Min:  1033 Max:  1033 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary +      1 in 00:01:02 =    0.0/s Avg:   669 Min:   669 Max:   669 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =      2 in 00:01:03 =    0.0/s Avg:   851 Min:   669 Max:  1033 Err:     0 (0.00%)
summary +      3 in 00:00:16 =    0.2/s Avg:   580 Min:   441 Max:   712 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =      5 in 00:01:19 =    0.1/s Avg:   688 Min:   441 Max:  1033 Err:     0 (0.00%)
summary +      1 in 00:01:14 =    0.0/s Avg:   659 Min:   659 Max:   659 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =      6 in 00:02:34 =    0.0/s Avg:   683 Min:   441 Max:  1033 Err:     0 (0.00%)
summary +      2 in 00:00:27 =    0.1/s Avg:   315 Min:     3 Max:   628 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =      8 in 00:03:01 =    0.0/s Avg:   591 Min:     3 Max:  1033 Err:     0 (0.00%)
summary +      2 in 00:00:23 =    0.1/s Avg:   323 Min:     0 Max:   646 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =     10 in 00:03:24 =    0.0/s Avg:   537 Min:     0 Max:  1033 Err:     0 (0.00%)
summary +      2 in 00:00:26 =    0.1/s Avg:   319 Min:     1 Max:   638 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =     12 in 00:03:50 =    0.1/s Avg:   501 Min:     0 Max:  1033 Err:     0 (0.00%)
summary +      2 in 00:00:25 =    0.1/s Avg:   321 Min:     0 Max:   642 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =     14 in 00:04:16 =    0.1/s Avg:   475 Min:     0 Max:  1033 Err:     0 (0.00%)
summary +      2 in 00:00:14 =    0.1/s Avg:    20 Min:     0 Max:    40 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
summary =     16 in 00:04:30 =    0.1/s Avg:   418 Min:     0 Max:  1033 Err:     0 (0.00%)
summary =     16 in 00:04:30 =    0.1/s Avg:   418 Min:     0 Max:  1033 Err:     0 (0.00%)
Tidying up ...    @ Mon Jul 13 14:25:38 IST 2020 (1594630538875)
... end of run