perftest03Dec.log
2018-12-03 13:33:32,818 INFO o.a.j.u.JMeterUtils: Setting Locale to en_US
2018-12-03 13:33:32,831 INFO o.a.j.JMeter: Loading user properties from: /apache-jmeter-4.0/bin/user.properties
2018-12-03 13:33:32,831 INFO o.a.j.JMeter: Loading system properties from: /apache-jmeter-4.0/bin/system.properties
2018-12-03 13:33:32,836 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2018-12-03 13:33:32,836 INFO o.a.j.JMeter: Version 4.0 r1823414
2018-12-03 13:33:32,836 INFO o.a.j.JMeter: java.version=1.8.0_191
2018-12-03 13:33:32,836 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2018-12-03 13:33:32,837 INFO o.a.j.JMeter: os.name=Linux
2018-12-03 13:33:32,837 INFO o.a.j.JMeter: os.arch=amd64
2018-12-03 13:33:32,837 INFO o.a.j.JMeter: os.version=4.4.0-1072-aws
2018-12-03 13:33:32,837 INFO o.a.j.JMeter: file.encoding=UTF-8
2018-12-03 13:33:32,837 INFO o.a.j.JMeter: Max memory     =3739746304
2018-12-03 13:33:32,837 INFO o.a.j.JMeter: Available Processors =4
2018-12-03 13:33:32,841 INFO o.a.j.JMeter: Default Locale=English (United States)
2018-12-03 13:33:32,841 INFO o.a.j.JMeter: JMeter  Locale=English (United States)
2018-12-03 13:33:32,841 INFO o.a.j.JMeter: JMeterHome=/apache-jmeter-4.0
2018-12-03 13:33:32,841 INFO o.a.j.JMeter: user.dir  =/var/lib/jenkins/workspace/PerformanceTest
2018-12-03 13:33:32,842 INFO o.a.j.JMeter: PWD       =/var/lib/jenkins/workspace/PerformanceTest
2018-12-03 13:33:32,843 INFO o.a.j.JMeter: IP: 10.192.11.192 Name: ip-10-192-11-192 FullName: ip-10-192-11-192.us-west-2.compute.internal
2018-12-03 13:33:32,846 INFO o.a.j.s.FileServer: Default base='/var/lib/jenkins/workspace/PerformanceTest'
2018-12-03 13:33:32,852 INFO o.a.j.s.FileServer: Set new base='/apache-jmeter-4.0/bin'
2018-12-03 13:33:32,981 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2018-12-03 13:33:32,995 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2018-12-03 13:33:33,000 INFO o.a.j.s.SaveService: Using SaveService properties version 4.0
2018-12-03 13:33:33,007 INFO o.a.j.s.SaveService: Loading file: /apache-jmeter-4.0/bin/cambridge.jmx
2018-12-03 13:33:33,049 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-12-03 13:33:33,050 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-12-03 13:33:33,050 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-12-03 13:33:33,050 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-12-03 13:33:33,050 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2018-12-03 13:33:33,050 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2018-12-03 13:33:33,083 INFO o.a.j.JMeter: Creating summariser <summary>
2018-12-03 13:33:33,088 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2018-12-03 13:33:33,088 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-12-03 13:33:33,088 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-12-03 13:33:33,092 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2018-12-03 13:33:33,093 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2018-12-03 13:33:33,489 INFO o.a.j.JMeter: Running test (1543844013489)
2018-12-03 13:33:33,541 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2018-12-03 13:33:33,541 INFO o.a.j.e.StandardJMeterEngine: Starting 2 threads for group Thread Group.
2018-12-03 13:33:33,541 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2018-12-03 13:33:33,541 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=2 ramp-up=1 perThread=500.0 delayedStart=false
2018-12-03 13:33:33,546 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2018-12-03 13:33:33,546 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2018-12-03 13:33:33,548 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2018-12-03 13:33:33,563 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = ip-10-192-11-192
2018-12-03 13:33:33,569 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2018-12-03 13:33:33,576 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2018-12-03 13:33:33,577 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2018-12-03 13:33:33,577 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2018-12-03 13:33:33,577 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2018-12-03 13:33:33,720 INFO o.a.j.p.h.s.LazySchemeSocketFactory: Setting up HTTPS TrustAll Socket Factory
2018-12-03 13:33:33,728 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2018-12-03 13:33:33,728 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2018-12-03 13:33:33,911 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2018-12-03 13:33:33,912 INFO o.a.j.u.SSLManager: KeyStore created OK
2018-12-03 13:33:33,912 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2018-12-03 13:33:34,048 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2018-12-03 13:33:37,432 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2018-12-03 13:33:37,432 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2018-12-03 13:33:37,725 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2018-12-03 13:33:37,725 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2018-12-03 13:33:37,725 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2018-12-03 13:33:37,726 INFO o.a.j.r.Summariser: summary =      2 in 00:00:04 =    0.5/s Avg:  3754 Min:  3676 Max:  3832 Err:     0 (0.00%)